# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = connection.cursor()#Your code here

## Display the names of all the employees in Boston.

In [11]:
c.execute('''
SELECT firstname, lastname
FROM employees
JOIN offices
USING(officeCode)
WHERE city IS 'Boston';''').fetchall()#Your code here

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

In [31]:
cur.execute("""select city,
                    count(*)
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Do any offices have no employees?

In [29]:
c.execute('''
SELECT o.city, o.officeCode, e.officeCode, e.firstname, e.lastname
FROM offices o
JOIN employees e
USING(officeCode)
ORDER BY officeCode''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df#Your code here

             city officeCode officeCode firstName   lastName
0   San Francisco          1          1   Anthony        Bow
1   San Francisco          1          1      Jeff   Firrelli
2   San Francisco          1          1    Leslie   Jennings
3   San Francisco          1          1     Diane     Murphy
4   San Francisco          1          1      Mary  Patterson
5   San Francisco          1          1    Leslie   Thompson
6          Boston          2          2     Julie   Firrelli
7          Boston          2          2     Steve  Patterson
8             NYC          3          3  Foon Yue      Tseng
9             NYC          3          3    George     Vanauf
10          Paris          4          4    Gerard     Bondur
11          Paris          4          4      Loui     Bondur
12          Paris          4          4    Pamela   Castillo
13          Paris          4          4    Martin     Gerard
14          Paris          4          4    Gerard  Hernandez
15          Tokyo          5          5   Yoshimi       Kato
16          Tokyo          5          5      Mami      Nishi
17         Sydney          6          6      Andy     Fixter
18         Sydney          6          6       Tom       King
19         Sydney          6          6     Peter      Marsh
20         Sydney          6          6   William  Patterson
21         London          7          7     Larry       Bott
22         London          7          7     Barry      Jones

## Write 3 Questions of your own and answer them

What product line has the most products kept in stock?

In [58]:
c.execute('''
SELECT pl.productLine, sum(p.quantityInStock) AS total_in_stock
FROM productLines pl
JOIN products p 
USING(productLine)
GROUP BY productLine
ORDER BY total_in_stock DESC;''')

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df# Your code here

        productLine  total_in_stock
0      Classic Cars          219183
1      Vintage Cars          124880
2       Motorcycles           69401
3            Planes           62287
4  Trucks and Buses           35851
5             Ships           26833
6            Trains           16696

What sales rep has the least amount of customers in their pipeline?

In [83]:
c.execute('''
SELECT e.firstname, e.lastname, e.employeeNumber, count(c.salesRepEmployeeNumber) AS num_of_customers
FROM customers c
JOIN employees e 
ON e.employeeNumber = c.salesRepEmployeeNumber
GROUP BY e.firstName
ORDER BY num_of_customers;''').fetchall()

[('Andy', 'Fixter', '1611', 5),
 ('Mami', 'Nishi', '1621', 5),
 ('Peter', 'Marsh', '1612', 5),
 ('Julie', 'Firrelli', '1188', 6),
 ('Loui', 'Bondur', '1337', 6),
 ('Martin', 'Gerard', '1702', 6),
 ('Steve', 'Patterson', '1216', 6),
 ('Foon Yue', 'Tseng', '1286', 7),
 ('Gerard', 'Hernandez', '1370', 7),
 ('George', 'Vanauf', '1323', 8),
 ('Larry', 'Bott', '1501', 8),
 ('Barry', 'Jones', '1504', 9),
 ('Pamela', 'Castillo', '1401', 10),
 ('Leslie', 'Jennings', '1165', 12)]

How many orders were made that cost more than $100?

In [93]:
df.priceEach.dtype

dtype('O')

In [92]:
c.execute('''
SELECT orderNumber, priceEach
FROM orderdetails
WHERE priceEach > 100.00;
''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]

df.priceEach.astype(float)
df.loc[df['priceEach']>100.00]

TypeError: '>' not supported between instances of 'str' and 'float'

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!